Revit 2027 API
DisplacementPath.AncestorIdx Property
 Specifies the end point of the path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int AncestorIdx { get; set; }
Public Property AncestorIdx As Integer
	Get
	Set
public:
property int AncestorIdx {
	int get ();
	void set (int value);
}
member AncestorIdx : int with get, set
Property Value
Int32
See Also
Reference
DisplacementPath Class
Autodesk.Revit.DB Namespace